modm-ext/data.modm.io/docs/svd/header_stm32u366xx.svd
        <register>
          <name>OEM1KEYR2</name>
          <description>FLASH OEM1 key register 2</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 [63:32] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM1KEYR3</name>
          <description>FLASH OEM1 key register 3</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 [95:64] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM1KEYR4</name>
          <description>FLASH OEM1 key register 4</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 [127:96] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM2KEYR1</name>
          <description>FLASH OEM2 key register 1</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 [31:0] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM2KEYR2</name>
          <description>FLASH OEM2 key register 2</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 [63:32] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM2KEYR3</name>
          <description>FLASH OEM2 key register 3</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 [95:64] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEM2KEYR4</name>
          <description>FLASH OEM2 key register 4</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 [127:96] bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OEMKEYSR</name>
          <description>FLASH OEM key status register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEM1KEYCRC</name>
              <description>8-bits OEMKEY1 CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OEM2KEYCRC</name>
              <description>8-bits OEMKEY2 CRC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <registers>
        <register>
          <name>DR</name>
          <description>CRC Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR</name>
              <description>Data register bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>CRC Independent data register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IDR</name>
              <description>General-purpose 32-bits data register bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>CRC Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>RESET the CRC computation unit bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLYSIZE</name>
              <description>Polynomial size bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POLYLENGTH_32B</name>
                  <description>32 bits Polynomial size</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYLENGTH_16B</name>
                  <description>16 bits Polynomial size</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYLENGTH_8B</name>
                  <description>8 bits Polynomial size</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLYLENGTH_7B</name>
                  <description>7 bits Polynomial size</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REV_IN</name>
              <description>REV_IN Reverse Input Data bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REV_OUT</name>
              <description>REV_OUT Reverse Output Data bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTYPE_IN</name>
              <description>RTYPE_IN Reverse Type Input bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT</name>
                  <description>Input Data reverse type at bit level granularity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE_HALFWORD</name>
                  <description>Input Data reverse type at byte or half-word level granularity</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTYPE_OUT</name>
              <description>RTYPE_OUT Reverse Type Output bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT</name>
                  <description>Output Data reverse type at bit level granularity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE_HALFWORD</name>
                  <description>Output Data reverse type at byte or half-word level granularity</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT</name>
          <description>Initial CRC value register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initial CRC value bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POL</name>
          <description>CRC polynomial register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POL</name>
              <description>Coefficients of the polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
