modm-ext/data.modm.io/docs/svd/header_stm32u366xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x420c0800</baseAddress>
      <interrupt>
        <name>RNG</name>
        <description>RNG global interrupt</description>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RNG control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RNGEN</name>
              <description>True random number generator enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <description>Interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CED</name>
              <description>Clock error detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARDIS</name>
              <description>Auto reset disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG3</name>
              <description>RNG configuration 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NISTC</name>
              <description>NIST custom</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG2</name>
              <description>RNG configuration 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divider factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BY_1</name>
                  <description>No clock division</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_2</name>
                  <description>2 RNG clock cycles per internal RNG clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_4</name>
                  <description>4 RNG clock cycles per internal RNG clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_8</name>
                  <description>8 RNG clock cycles per internal RNG clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_16</name>
                  <description>16 RNG clock cycles per internal RNG clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_32</name>
                  <description>32 RNG clock cycles per internal RNG clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_64</name>
                  <description>64 RNG clock cycles per internal RNG clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_128</name>
                  <description>128 RNG clock cycles per internal RNG clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_256</name>
                  <description>256 RNG clock cycles per internal RNG clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_512</name>
                  <description>512 RNG clock cycles per internal RNG clock</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_1024</name>
                  <description>1024 RNG clock cycles per internal RNG clock</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_2048</name>
                  <description>2048 RNG clock cycles per internal RNG clock</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_4096</name>
                  <description>4096 RNG clock cycles per internal RNG clock</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_8192</name>
                  <description>8192 RNG clock cycles per internal RNG clock</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_16384</name>
                  <description>16384 RNG clock cycles per internal RNG clock</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_32768</name>
                  <description>32768 RNG clock cycles per internal RNG clock</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_CONFIG1</name>
              <description>RNG configuration 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CONDRST</name>
              <description>Conditioning soft reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIGLOCK</name>
              <description>RNG configuration lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RNG status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>RNG data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NSCR</name>
          <description>RNG noise source control register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN_OSC1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC2</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR0</name>
          <description>RNG health test configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HTCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR1</name>
          <description>RNG health test configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HTCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR2</name>
          <description>RNG health test configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HTCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR3</name>
          <description>RNG health test configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HTCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTSR0</name>
          <description>RNG health test status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RPERRX</name>
              <description>Repetitive error after the XOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR1</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR2</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR3</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR4</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR5</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR6</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR7</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR8</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPERR9</name>
              <description>Repetitive error for oscillator i</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTSR1</name>
          <description>RNG health test status register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADERRX</name>
              <description>Adaptative error after the XOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR1</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR2</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR3</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR4</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR5</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR6</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR7</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR8</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADERR9</name>
              <description>Adaptative error for oscillator i</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSMR</name>
          <description>RNG health test status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MOSC1</name>
              <description>Mask oscillator i</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC2</name>
              <description>Mask oscillator i</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC3</name>
              <description>Mask oscillator i</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC4</name>
              <description>Mask oscillator i</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC5</name>
              <description>Mask oscillator i</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC6</name>
              <description>Mask oscillator i</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC7</name>
              <description>Mask oscillator i</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC8</name>
              <description>Mask oscillator i</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSC9</name>
              <description>Mask oscillator i</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
